from backend.config import Config
from backend.crawler.paragraph_generator.hindi import HindiParagraphGenerator
from scratch.prod_setup import prod_setup

scan_config = {
    "header_prefix": [
        "^.*पर\\s+प्रवचन",
        "^.{0,5}प्रवचन\\s?नं.*[०-९]{1,2}-[०-९]{2,4}",
        "^.{0,5}गाथा[\\s-][०-९]{1,4}.{0,20}[०-९]{2,4}",
        "^.{0,5}कारण\\s*.?\\s*कार्य\\s*.?\\s*नियम(?:\\s+\\(?भाग\\s*-?\\s*[०-९]+\\s*\\)?)?(?:\\s+[०-९]+)*\\s*",
        "^.{0,5}\\s*श्लोक-\\s*[०-९]+(?:(?:\\s+से)?\\s+[०-९]+)*\\s*",
        "^.{0,5}\\s*गाथा-\\s*[०-९]+(?:(?:\\s+से)?\\s+[०-९]+)*\\s*",
        "^[०-९]+(?!\\. )",
        "^विशेष आयेगा",
        "^विशेष कहेंगे",
        "^\\(?श्रोता: प्रमाण वचन"
    ],
    "header_regex": [
        "^.{0,5}गाथा.{0,30}$",
        "^.{0,5}कलश.{0,30}$",
        "^.{0,5}श्लोक.{0,30}$",
        "^.*पर\\s+प्रवचन.{0,30}$",
        "^.{0,5}प्रवचन\\s?नं.*[०-९]{0,6}.{0,20}$",
        "^[०-९\\s]*$",
        "^\\*\\s+",
        "^[०-९]\\.\\s+",
        "^[०-९\\s]*$",
        "^[०-९]+(?!\\. )$",
        "^.{0,20}$",
        "^.{0,5}गाथा.{0,30}$",
        "^.{0,5}कलश.{0,30}$",
        "^प्रवचन\\s+नं\\.?.*$",
        "^[०-९\\s]*$",
        "^प्रवचन-[०-९]+,?\\s*(?:(?:श्लोक|गाथा)-[०-९]+(?:(?:\\s+से)?\\s+[०-९]+)*,?\\s*)?.*?दिनांक\\s+[०-९]+(?:-[०-९]+){2}\\s*",
        "^प्रवचन-[०-९]+",
        "^\\*\\s+",
        "^[०-९]\\.\\s+",
        "^[०-९\\s]*$",
        "^[०-९]\\.\\s+",
        "^वी\\.?\\s+सं\\.?"
    ],
    "page_list": [],
    "typo_list": "<list of 24 items truncated>",
    "file_url": "",
    "start_page": 17,
    "end_page": 518,
    "language": "hi"
}

prod_setup(console_only=True, logs_dir="logs")
para_gen = HindiParagraphGenerator(Config())

para = "गाथा ४५-४६ वण्णरसगं धफासा थीपुसणउंसयादिपज्जाया। संठाणा संहणणा सठ्वे जीवस्स णो संति।।४५।।। अरस-मरूव-मगंधं अव्वत्त चेदणा-गुण-मसहं। जाण अलिगग्गहणं जीव-मणिहिट्ट -संठाणं।।४६।। देखो, यह गाथा आयी। यह गाथा तो सब जगह है। यह ४६ गाथा है न? यह समयसार में है, प्रवचनसार में है, नियमसार में है, पंचास्तिकाय में है, अष्टरपाहुड़ में है और षट्खण्डागम में है। बहुत पुरानी गाथा है। यह ४६वीं गाथा प्र    "

print(para_gen._is_header_footer(
    0, para, scan_config["header_prefix"], scan_config["header_regex"]
))

